Config/Documents/РешениеОПризнанииОбъектовМЗИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РешениеОПризнанииОбъектовМЗИК</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронныйДокументПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НаличиеДрагМатериаловВОбъектахНФА</xr:Item>
				<xr:Item>AccumulationRegister.ОтражениеЭДВУчете</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПризнанияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаОперацииСДрагМатериалами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАналитикиОперацииСДрагМатериалами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезолюцияКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РезолюцияКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВсегоДМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДрагоценныеМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНФА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДрагМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаДМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурнаяМасса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистаяМасса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникОбразования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиОбразованияОтходовИЛомаДрагМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отсутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОВидахРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДемонтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТранспортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРемонта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоОкончанииРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/НаличиеДрагМатериаловВОбъектахНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НаличиеДрагМатериаловВОбъектахНФА</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МассаДМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоСписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАналитикиОперацииСДрагМатериалами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНФА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДрагМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/ТипыДрагМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДрагМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеКамни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РешениеОПризнанииОбъектовМЗИК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание");
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			
			Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(Основание.Организация) Тогда
				РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(Основание);
				Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
					ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(Основание, РазличающаясяНоменклатураКонтрагентаИОрганизации);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;	
			
			ЗаполнитьПоЭлектронномуДокументуПоставщика(Основание,
				ДанныеЗаполнения.НоменклатураДляОтраженияВУчете.Выгрузить());
		КонецЕсли;
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ДанныеЗаполнения)) Тогда
		
		ЗаполнитьПоОснованию(ДанныеЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	ОбщегоНазначенияБГУ.ЗаполнитьИдентификаторыСтрок(Материалы, Ложь);
	
	СуммаДокумента = Материалы.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ)
	
	ДрагМатериалы = ДрагоценныеМатериалы.Выгрузить(,"НомерСтроки, ОбъектНФА");
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить(,"ОбъектНФА");
	ОбъектыДМ.Свернуть("ОбъектНФА");
	
	ТаблицаВсехОбъектов = Материалы.Выгрузить(,"СчетУчета, Номенклатура");
	
	ТаблицаОбъектовНФА = Новый ТаблицаЗначений;
	ТаблицаОбъектовНФА.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовМЗ.Найти(ТекСтрока.СчетУчета)<>Неопределено Тогда
			НоваяСтрока = ТаблицаОбъектовНФА.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекСтрока Из ОбъектыДМ Цикл
		ОбъектНФА = ТекСтрока.ОбъектНФА;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", ОбъектНФА);
		НайденныеСтроки = ТаблицаОбъектовНФА.НайтиСтроки(ПараметрыОтбора);   

		Если НайденныеСтроки.Количество() = 0 Тогда
			ПараметрыОтбораОбъекта = Новый Структура;
			ПараметрыОтбораОбъекта.Вставить("ОбъектНФА", ОбъектНФА);
			СтрокиСпискаДМ = ДрагМатериалы.НайтиСтроки(ПараметрыОтбораОбъекта);
			Если СтрокиСпискаДМ.Количество()=1 Тогда
				ТекстСтрокиДМ = "В строке ";
			Иначе
				ТекстСтрокиДМ = "В строках ";
			КонецЕсли;
			Для каждого ТекСтрокаДМ Из СтрокиСпискаДМ Цикл
				ТекстСтрокиДМ = ТекстСтрокиДМ + Формат(ТекСтрокаДМ.НомерСтроки, "ЧЦ=10") + ", ";
			КонецЦикла;	
			
			ТекстОшибки = НСтр("ru='"+Сред(ТекстСтрокиДМ, 1, СтрДлина(ТекстСтрокиДМ)-2)+" списка ""Содержание драг. материалов"" указана информация по номенклатуре, которой нет в списке ""Материальные запасы"": %1'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ОбъектНФА);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
			
		КонецЕсли;	
	КонецЦикла;	
	
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить();
	Для каждого ТекСтрока Из ОбъектыДМ Цикл
		//контроль лом/не лом
		Если (ТекСтрока.МассаДМ > 0)И(ТекСтрока.ЛигатурнаяМасса > 0 ИЛИ ТекСтрока.ЧистаяМасса>0) Тогда
			ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" следует указать массу в реквизите ""Масса драг. материалов"" или в реквизитах ""Лигатурная масса лома"" и ""Чистая масса в ломе"": ""%1""'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТекСтрока.ОбъектНФА, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;	
		
		//заполнение количества драг. камней
		Если НЕ (ТекСтрока.ВидДрагМатериала.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни)И(ТекСтрока.КоличествоДМ > 0) Тогда
			ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" значение реквизита ""Количество (шт)"" указывается только для драгоценных камней: ""%1""'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТекСтрока.ОбъектНФА, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;	
	КонецЦикла;
	
	//контроль содержания учетных драг. материалов в списываемых НФА
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ДрагМатериалыДокумента.ОбъектНФА,
	               |	ДрагМатериалыДокумента.МассаДМ,
	               |	ДрагМатериалыДокумента.ЛигатурнаяМасса,
	               |	ДрагМатериалыДокумента.ЧистаяМасса,
	               |	ДрагМатериалыДокумента.КоличествоДМ
	               |ПОМЕСТИТЬ ДрагМатериалыДокумента
	               |ИЗ
	               |	&ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ОбъектыДокумента.Номенклатура
	               |ПОМЕСТИТЬ ОбъектыДокумента
	               |ИЗ
	               |	&ОбъектыДокумента КАК ОбъектыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОбъектыНФАДокумента.Организация,
	               |	ОбъектыНФАДокумента.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДрагМатериалыДокумента.МассаДМ, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЛигатурнаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЧистаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.КоличествоДМ, 0) = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьДрагМатериалы
	               |ПОМЕСТИТЬ ОбъектыНФАДокумента
	               |ИЗ
	               |	ОбъектыДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |		ПО ОбъектыНФАДокумента.Организация = ДрагМатериалыДокумента.Организация
	               |			И ОбъектыНФАДокумента.Номенклатура = ДрагМатериалыДокумента.ОбъектНФА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОбъектНФА,
	               |	0 КАК ЧистаяМассаОстаток,
	               |	0 КАК ЛигатурнаяМассаОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток КАК МассаДМОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток КАК КоличествоДМОстаток,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы КАК ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО (НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВОбъектахНФАОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЧистаяМассаОстаток,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЛигатурнаяМассаОстаток,
	               |	0,
	               |	0,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВЛомеИОтходах.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВЛомеИОтходахОстатки
	               |		ПО (НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВЛомеИОтходахОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ";
				   
	ТаблицаОбъектовНФА = Материалы.Выгрузить(,"Номенклатура");
	
	Запрос.УстановитьПараметр("ДрагМатериалыДокумента", ОбъектыДМ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбъектыДокумента", ТаблицаОбъектовНФА);
	Запрос.УстановитьПараметр("ДатаСведений", Новый Граница(Ссылка.Дата, ВидГраницы.Включая));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = НСтр("ru='Для объекта ""%1"" из списка ""Материальные запасы"" в учете присутствуют остатки драгоценных материалов. Следует заполнить данные списка ""Содержание драг. материалов"" на закладке ""Драгоценные материалы"" и провести документ.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ОбъектНФА);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект");
	КонецЦикла;	
	
КонецПроцедуры	

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоОснованию(ДанныеЗаполнения, СтандартнаяОбработка = Истина) Экспорт

	ТипОснования = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипОснования = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда	

		Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(ДанныеЗаполнения.Организация) Тогда
			РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(ДанныеЗаполнения);
			Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
				ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(ДанныеЗаполнения, РазличающаясяНоменклатураКонтрагентаИОрганизации);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли;	
		
		ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения, СписокНоменклатуры = Неопределено) Экспорт
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеМЗ;
	
	ДатаПодписания = Дата(1,1,1);
	Если ДанныеЗаполнения.ЗагруженИзЕИС Тогда
		ДатаПодписания = ЭлектронныеДокументыБГУ.ДатаПоследнейЭлектроннойПодписиЭД(ДанныеЗаполнения);
		Если ЗначениеЗаполнено(ДатаПодписания) Тогда
			Дата = ДатаПодписания;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПодписания) Тогда
		Дата = ЭлектронныеДокументыБГУ.ДатаВходящегоИзвещенияЭДП(ДанныеЗаполнения);
	КонецЕсли;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	ДокументОснование = ДанныеЗаполнения;
	СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("105.00");
	
	Если НЕ ТипЗнч(СписокНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		СписокНоменклатуры = ЭлектронныеДокументыБГУВызовСервера.СписокДоступнойНоменклатурыЭДПоставщика(ТипДокументаУчета, ДокументОснование);
	КонецЕсли;
	
	ПараметрыОбработкиСтроки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(ЭтотОбъект);
	ПараметрыОбработкиСтроки.Вставить("ДтКт", "Дт");
	ИспользуемыеИдентификаторы = Новый Массив;
	
	Для Каждого СтрокаТЧ из СписокНоменклатуры Цикл
		Если СтрокаТЧ.КодВидаНоменклатуры = 1 Тогда 
			НоваяСтрока = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			ПараметрыОбработкиСтроки.Номенклатура = НоваяСтрока.Номенклатура;
			НоваяСтрока.Сумма = СтрокаТЧ.Всего;
		КонецЕсли;
	КонецЦикла;
	
	СуммаДокумента = Материалы.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
